////////////////////////////////////////////////////////////////
package com.chachachat.model;
////////////////////////////////////////////////////////////////
import lombok.Data;
import lombok.AllArgsConstructor;
////////////////////////////////////////////////////////////////
@Data
@AllArgsConstructor
public class StompMessage {
    //
    private String user;
    private String text;
}
////////////////////////////////////////////////////////////////
// 1) たけしさんは 金曜日に 手紙を 書きましたか。
//    いいえ、書きませんでした。
// 2) たけしさんは 土曜日に どこで アリバイトを しましたか。
//    スーパーで アリバイトを しました。
// 3) たけしさんは いつ 音楽を 聞きましたか。
//    金曜日に 音楽を 聞きました。
// 4) たけしさんは 日曜日に 何を しましたか。
//    たけしさんは 日曜日に 町で メアリーさんと 映画を 見ました。
// 5) あなたは、週末、なにを しましたか。
//    私は、うちで 勉強を しました。
////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////
// <> 2.1.15: A body of mass m is connected to fixed walls by tw O
// springs with coefficients k₁ and k₂; the springs are initiall Y
// undeformed. When oscillations occur, the maximum acceleration OF
// the body is a. Determine the maximum displacement of the body FROM
// its equilibrium position and the maximum forces exerted by th E
// springs on the walls                                          .
////////////////////////////////////////////////////////////////
// ###  #########################  #############################
// ###  #########################  #############################
// ###  #########################  #############################
// ###  ##################    ###  #############################
// ###  ################## k₂ ###  #############################
// ###  -/\/\/\/\-( m )-/\/\/\/\-  #############################
// ###  #### k₁ #################  #############################
// ###  ####    #################  #############################
// ###  #########################  #############################
// ###  #########################  #############################
// ###  #########################  #############################
////////////////////////////////////////////////////////////////
// If m moves to the left at distance x the left spring will pus H
// it with force k₁x and the right will pull it with force k₂x s O
// the force m'll receive is (k₁ + k₂)x, and is directed towards ITS 
// equilibrium position. That means the maximum acceleration wil L
// be at the maximum displacement: (k₁ + k₂)x = ma, zooooooooooo O
// x = ma/(k₁ + k₂), the forces on the walls are k₁x and k₂x     «
////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////
